tap "amir1376/tap"
tap "mongodb/brew", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@18", link: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Download manager that speeds up your downloads
cask "amir1376/tap/ab-download-manager", trusted: true
# AI Coding Agent IDE
cask "antigravity-ide"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Clipboard manager
cask "maccy"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Android file transfer
cask "openmtp"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "anderseandersen.html-class-suggestions"
vscode "dzhavat.bracket-pair-toggler"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "funkyremi.vscode-google-translate"
vscode "monokai.theme-monokai-pro-vscode"
vscode "naumovs.color-highlight"
vscode "ritwickdey.liveserver"
vscode "steoates.autoimport"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "zignd.html-css-class-completion"
